#include <stdio.h>
#include <cstdlib> //для srand(), rand()
#include <time.h> //для time()
#define m 4 //константа - розмір масиву

int main()
{
	//оголошення загального двовимірного масиву а і одновимірного масиву max для максимальних елементів із рядків
	int a[m][m], max[m];
	long int p = 1; //змінна для збереження добутку максимальних елементів
	printf("the elements of array\n"); //повідомлення про виведення масиву
	srand(time(NULL)); //точка відліку для rand() - поточний час (для отримання різних генерацій під час різних запусків)
	//цикл для всіх елементів масиву а
	for (int i = 0; i < m; i++) {
		for (int j = 0; j < m; j++) {
			a[i][j] = rand() % 100; //генерація випадкового числа від 0 до 99
			printf("%2d ", a[i][j]); //виведення елемента
		}
		printf("\n");
	}
	//цикл для всіх елементів масиву а
	for (int i = 0; i < m; i++) {
		max[i] = a[i][0]; //присвоєння елементу масиву max[i] значення першого елемента і-го рядка масиву а
		for (int j = 0; j < m; j++) {
			if (max[i] < a[i][j]) max[i] = a[i][j]; //якщо max[i] < a[i][j], то присвоєння йому значення a[i][j]
		}
	}
	//цикл для всіх елементів масиву max
	for (int i = 0; i < m; i++) {
		p = p * max[i]; //обчислення добутку елементів
	}
	printf("the product of the maximum elements of the rows is %ld", p); //виведення результату
	return 0;
}


	